import java.security.NoSuchAlgorithmException;

public class Table {
	
	public  void table3() throws NoSuchAlgorithmException {
		System.out.format("+-------+-----------+-----------+-------------+%n");
		System.out.format("|PC/User|     1     |     2     |      3      |%n");
		System.out.format("+-------+-----------+-----------+-------------|%n");
		System.out.format("|   1   |   Ничья   |  Победа   |  Поражение  |%n");
		System.out.format("+-------+-----------+-----------+-------------|%n");
		System.out.format("|   2   | Поражение |   Ничья   |    Победа   |%n");
		System.out.format("+-------+-----------+-----------+-------------|%n");
		System.out.format("|   3   |  Победа   | Поражение |    Ничья    |%n");
		System.out.format("+-------+-----------+-----------+-------------|%n");
}

		// TODO Auto-generated method stub
		public  void table5() throws NoSuchAlgorithmException {
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|PC/User|     1     |     2     |      3    |     4     |      5    |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   1   |   Ничья   | Поражение | Поражение | Поражение |   Победа  |%n");
			System.out.format("+-------+-----------+-----------+-----------|-----------+-----------+%n");
			System.out.format("|   2   |   Победа  |   Ничья   | Поражение | Поражение | Поражение |%n");
			System.out.format("+-------+-----------+-----------+-----------|-----------+-----------+%n");
			System.out.format("|   3   |  Победа   |   Победа  |   Ничья   | Поражение | Поражение |%n");
			System.out.format("+-------+-----------+-----------+-----------|-----------+-----------+%n");
			System.out.format("|   4   |  Победа   |   Победа  |   Победа  |   Ничья   | Поражение |%n");
			System.out.format("+-------+-----------+-----------+-----------|-----------+-----------+%n");
			System.out.format("|   5   | Поражение |   Победа  |   Победа  |  Победа   |   Ничья   |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+%n");
	}
		public  void table7() throws NoSuchAlgorithmException {
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|PC/User|     1     |     2     |      3    |     4     |      5    |     6     |      7    |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   1   |   Ничья   | Поражение | Поражение | Поражение |   Победа  |   Победа  |  Победа   |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   2   |   Победа  |   Ничья   | Поражение | Поражение | Поражение |   Победа  |  Победа   |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   3   |  Победа   |   Победа  |   Ничья   | Поражение | Поражение | Поражение |   Победа  |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   4   |  Победа   |   Победа  |   Победа  |   Ничья   | Поражение | Поражение | Поражение |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   5   | Поражение |   Победа  |   Победа  |  Победа   |   Ничья   | Поражение | Поражение |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   4   | Поражение | Поражение |   Победа  |   Победа  |   Победа  |   Ничья   | Поражение |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
			System.out.format("|   5   | Поражение | Поражение | Поражение |  Победа   |   Победа  |  Победа   |   Ничья   |%n");
			System.out.format("+-------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+%n");
		}
	
}
